//: [Previous](@previous)
import UIKit

/***************************************************
 1. Array, Set, Dictionary 의 차이점에 대해 설명하고 예시 코드 작성
 ***************************************************/
//Array는 배열을 한다. [1, 2, 3]
//


/***************************************************
 2. Value Type, Reference Type 에 대한 예시와 그 차이점에 대해 설명
 ***************************************************/



/***************************************************
 3. Application의 LifeCycle의 각 상태에 대해 설명
 ***************************************************/



/***************************************************
 4. ViewController LifeCycle의 각 상태에 대해 설명
 ***************************************************/

//EditingDidBegin -> EditingDidChange -> EditingDidEnd ->


/***************************************************
 5. 다음 4개의 키워드 (continue, break, return, fallthrough)가 쓰이는 위치와 역할에 대해 각각 설명
 ***************************************************/
//continue는 해당 문장을 종료하고 바로 다음 문장으로 넘어간다.
//break는 그냥 종료
//return은 값을 내뱉는다.
//fallThrough는 값을 가지고 다음 문장으로 내려가서 실행한다.


/***************************************************
 6. Init 메서드가 필요한 경우와 그렇지 않은 경우의 차이점에 대해 설명
 ***************************************************/



/***************************************************
 7. Access Level 을 각 단계별로 나열하고 그 차이점에 대해 설명
 ***************************************************/



/***************************************************
 8. OOP 4대 특성에 대해 나열하고 각 특성에 대해 아는 만큼 설명 및 예시 코드 작성
 ***************************************************/



/***************************************************
 9. Frame 과 Bounds가 무엇이고, 둘의 차이점은 어떤 것이 있는지 설명
 ***************************************************/

//Frame은 값을 주는 대로 그 값만큼 움직인다. 그리고 그 안에 들어있는 것들도 같이 움직인다.
//Bounds는 값을 주면 그 안에 있는 대상은 준 값과 반대 방향으로 움직인다.


/***************************************************
 위 개념들은 아직 익숙치 않아서 답변하지 못한 분들이 많을 수 있지만
 중요한 내용들이니 답하지 못한 질문들은 체크해두었다가 천천히 공부하세요.
 ***************************************************/


//: [Next](@next)
