//
//  DictionaryData.swift
//  Dominos11_Starter
//
//  Created by ㅇ오ㅇ on 2020/06/11.
//  Copyright © 2020 Kira. All rights reserved.
//

import Foundation

let dictData: [String: [String: Int]] = [
  "슈퍼시드": [
    "글램핑 바비큐": 10000,
    "알로하 하와이안": 10000,
    "우리 고구마": 10000,
    "콰트로 치즈 퐁듀": 10000,
  ],
  "프리미엄": [
    "더블크러스트 이베리코": 10000,
    "블랙앵거스 스테이크": 10000,
    "블랙타이거 슈림프": 10000,
    "와규 앤 비스테카": 10000,
    "직화 스테이크": 10000,
  ],
  "클래식": [
    "포테이토": 10000,
    "슈퍼디럭스": 10000,
    "슈퍼슈프림": 10000,
    "베이컨체더치즈": 10000,
    "불고기": 10000,
    "페퍼로니": 10000,
  ],
  "사이드디시": [
    "딸기 슈크림": 7000,
    "슈퍼곡물 치킨": 7000,
    "애플 크러스트 디저트": 7000,
    "치킨퐁듀 그라탕": 7000,
    "퀴노아 치킨 샐러드": 7000,
    "포테이토 순살치킨": 7000,
  ],
  "음료": [
    "미닛메이드 스파클링 청포도": 3000,
    "스프라이트": 3000,
    "코카콜라": 3000,
    "코카콜라 제로": 3000,
  ],
  "피클소스": [
    "갈릭 디핑 소스": 500,
    "스위트 칠리소스": 500,
    "우리 피클 L": 500,
    "우리 피클 M": 500,
    "핫소스": 500,
  ]
]


